<?php

namespace App\Http\Controllers\Api\Personnel;

use Illuminate\Http\Request;
use App\Http\Controllers\Controller;
use App\Home\Announcement;
use App\Home\Personnel\Behavior;

class BehaviorController extends Controller
{
    //显示行为页
    public function behaviors(){
    	$announcements = Announcement::where('scope','6')->orderBy('createtime','desc')->limit('10')->get();
    	$behaviors = Behavior::get();
    	return array(
    		'announcements'	=> $announcements,
    		'behaviors'		=> $behaviors
    	);
    }

    // 这里加一个行为初始化的数组，直接写进数据库了
    public function behaviorsInit() {
    	$behaviors = array(
    		['用户推荐',10,'用户推荐'],
    		['分享',20,'分享'],
    		['浏览量',1,'浏览'],
    		['关注',20,'关注'],
    		['取消关注',-20,'取消关注'],
    		['收藏',25,'收藏'],
    		['取消收藏',-25,'取消收藏'],
    		['添加参考文献',10,'添加参考文献'],
    		['删除参考文献',-10,'删除参考文献'],
    		['引用',10,'引用'],
    		['取消引用',-10,'取消引用'],
    		['被引用',20,'被引用'],
    		['取消被引用',-20,'取消被引用'],
    		['主内容被举报',-50,'主内容被举报'],
    		['用户编辑',10,'用户编辑（占位）'],
    		['协作成员加入',50,'协作成员加入'],
    		['协作成员退出',-50,'协作成员退出'],
    		['协作成员被请出',-80,'协作成员被请出'],
    		['协作讨论发表',5,'协作讨论发表'],
    		['协作网友留言',10,'协作网友留言'],
    		['协作留言回复',8,'协作留言回复'],
    		['协作留言举报',-20,'协作留言举报'],
    		['协作投票',10,'协作投票'],
    		['评审计划开启',50,'评审计划开启'],
    		['评审反对建立',-30,'评审反对建立'],
    		['评审反对接受',30,'评审反对接受'],
    		['评审支持/中立意见',20,'评审支持/中立意见'],
    		['评审支持/中立意见回复',10,'评审支持/中立意见回复'],
    		['评审建议',30,'评审建议'],
    		['评审建议拒绝',-30,'评审建议拒绝'],
    		['评审建议接受',10,'评审建议接受'],
    		['评审反对意见举报',-100,'评审反对意见举报'],
    		['评审建议意见举报',-80,'评审建议意见举报'],
    		['评审支持/中立意见举报',-50,'评审支持/中立意见举报'],
    		['评审意见回复的举报',-30,'评审意见回复的举报'],
    		['评审成功',100,'评审成功'],
    		['评审失败',-200,'评审失败'],
    		['主内容升级',100,'主内容升级'],
    		['主内容降级',-100,'主内容降级'],
    		['发布求助',50,'发布求助'],
    		['发布帮助',50,'发布帮助'],
    		['帮助的接受',20,'帮助的接受'],
    		['帮助的拒绝',-20,'帮助的拒绝'],
    		['帮助的回复',15,'帮助的回复'],
    		['求助的举报',-100,'求助的举报'],
    		['帮助的举报',-100,'帮助的举报'],
    		['帮助的回复举报',-30,'帮助的回复举报'],
    		['反对讨论',-100,'反对讨论'],
    		['接受反对讨论',20,'接受反对讨论'],
    		['拒绝反对讨论',-100,'拒绝反对讨论'],
    		['建议讨论',50,'建议讨论'],
    		['接受建议',20,'接受建议'],
    		['拒绝建议',-20,'拒绝建议'],
    		['普通讨论',20,'普通讨论'],
    		['普通讨论回复',20,'普通讨论回复'],
    		['反对讨论举报',-100,'反对讨论举报'],
    		['建议讨论举报',-80,'建议讨论举报'],
    		['讨论举报',-50,'讨论举报'],
    		['攻辩的创建',100,'攻辩的创建'],
    		['攻辩的攻方发言',50,'攻辩的攻方发言'],
    		['攻辩的辩方发言',50,'攻辩的辩方发言'],
    		['攻辩的裁判加入',20,'攻辩的裁判加入'],
    		['攻辩的裁判发言',30,'攻辩的裁判发言'],
    		['攻辩的攻方放弃',-50,'攻辩的攻方放弃'],
    		['攻辩的辩方放弃',-100,'攻辩的辩方放弃'],
    		['攻辩的攻方胜利',50,'攻辩的攻方胜利'],
    		['攻辩的辩方胜利',100,'攻辩的辩方胜利'],
    		['攻辩的裁判误时',-50,'攻辩的裁判误时（占位）'],
    		['攻辩的网友留言',15,'攻辩的网友留言'],
    		['攻辩的网友留言回复',15,'攻辩的网友留言回复'],
    		['攻辩的攻方举报',-50,'攻辩的攻方举报'],
    		['攻辩的辩方举报',-100,'攻辩的辩方举报'],
    		['攻辩的裁判举报',-50,'攻辩的裁判举报'],
    		['攻辩的留言举报',-30,'攻辩的留言举报'],
    		['协作计划的阶段完成',50,'协作计划的阶段完成(占位)'],
    		['攻辩点赞攻方',5,'攻辩点赞攻方'],
    		['攻辩点赞辩方',5,'攻辩点赞辩方'],
    		['攻辩点赞裁判',5,'攻辩点赞裁判'],
    	);
    	$count = 0;
    	for($i=0;$i<count($behaviors);$i++) {
    		Behavior::behaviorAdd($behaviors[$i][0],$behaviors[$i][1],$behaviors[$i][2]);
    		$count++;
    	}
        $behaviors = Behavior::get();
    	return [
    		'success'     => $count? true:false,
	    	'behaviors'   => $behaviors
	    ];
    	
    }
}
